nickdpz/Filtro-Digital-Ajustable-por-Ventaneo/FiltroDigital.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ISR_SW.h"
#include "LCD.h"
#include "SW_aliases.h"
#include "SW.h"
#include "P0_aliases.h"
#include "P0.h"
#include "Control.h"
#include "ADC.h"
#include "Timer.h"
#include "timer_clock.h"
#include "Pin_1_aliases.h"
#include "Pin_1.h"
#include "IRS_T.h"
#include "DAC.h"
#include "DMA_dma.h"
#include "ISR_Data.h"
#include "Pin_2ADC_aliases.h"
#include "Pin_2ADC.h"
#include "LCD_LCDPort_aliases.h"
#include "LCD_LCDPort.h"
#include "ADC_AMux.h"
#include "ADC_Ext_CP_Clk.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

